
===========================================================================
report_tns
============================================================================
tns -2.41

===========================================================================
report_wns
============================================================================
wns -1.14

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.14

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.10
