
===========================================================================
report_checks -unconstrained
===========================================================================
======================= Typical Corner ===================================

No paths found.


===========================================================================
report_checks --slack_max -0.01
============================================================================
======================= Typical Corner ===================================

No paths found.


===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================
======================= Typical Corner ===================================



===========================================================================
report_parasitic_annotation -report_unannotated
============================================================================
Found 18 unannotated drivers.
 clk
 enable
 f_select[0]
 f_select[1]
 f_select[2]
 f_select[3]
 f_select[4]
 f_select[5]
 f_select[6]
 f_select[7]
 _0_/HI
 _0_/LO
 _1_/HI
 _1_/LO
 _2_/HI
 _2_/LO
 _3_/HI
 _3_/LO
Found 0 partially unannotated drivers.

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================

===========================================================================
check_setup -verbose -unconstrained_endpoints -multiple_clock -no_clock -no_input_delay -loops -generated_clocks
===========================================================================
Warning: There are 4 unconstrained endpoints.
  phi_l1
  phi_l2
  phi_p
  phi_r
