OpenROAD 41a51eaf4ca2171c92ff38afb91eb37bbd3f36da 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO]: Reading ODB at '/openlane/designs/digital_desing/runs/RUN_2024.07.08_19.16.14/tmp/placement/7-global.odb'…
define_corners Typical
read_liberty -corner Typical /home/celina/.volare/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
Using 1e-12 for capacitance...
Using 1e+03 for resistance...
Using 1e-09 for time...
Using 1e+00 for voltage...
Using 1e-03 for current...
Using 1e-09 for power...
Using 1e-06 for distance...
Reading design constraints file at '/openlane/designs/digital_desing/runs/RUN_2024.07.08_19.16.14/tmp/floorplan/3-initial_fp.sdc'…
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
======================= Typical Corner ===================================

No paths found.

min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
======================= Typical Corner ===================================

No paths found.

max_report_end
checks_report

===========================================================================
report_checks -unconstrained
===========================================================================
======================= Typical Corner ===================================

No paths found.


===========================================================================
report_checks --slack_max -0.01
============================================================================
======================= Typical Corner ===================================

No paths found.


===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================
======================= Typical Corner ===================================



===========================================================================
report_parasitic_annotation -report_unannotated
============================================================================
Found 18 unannotated drivers.
 clk
 enable
 f_select[0]
 f_select[1]
 f_select[2]
 f_select[3]
 f_select[4]
 f_select[5]
 f_select[6]
 f_select[7]
 _0_/HI
 _0_/LO
 _1_/HI
 _1_/LO
 _2_/HI
 _2_/LO
 _3_/HI
 _3_/LO
Found 0 partially unannotated drivers.

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================

===========================================================================
check_setup -verbose -unconstrained_endpoints -multiple_clock -no_clock -no_input_delay -loops -generated_clocks
===========================================================================
Warning: There are 4 unconstrained endpoints.
  phi_l1
  phi_l2
  phi_p
  phi_r
checks_report_end
power_report

===========================================================================
 report_power
============================================================================
======================= Typical Corner ===================================

Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          0.00e+00   0.00e+00   1.04e-10   1.04e-10 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  0.00e+00   0.00e+00   1.04e-10   1.04e-10 100.0%
                           0.0%       0.0%     100.0%

power_report_end
skew_report

===========================================================================
report_clock_skew
============================================================================
Clock clk
No launch/capture paths found.

skew_report_end
summary_report

===========================================================================
report_tns
============================================================================
tns 0.00

===========================================================================
report_wns
============================================================================
wns 0.00

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack INF
summary_report_end
area_report

===========================================================================
report_design_area
============================================================================
Design area 35 u^2 2% utilization.
area_report_end
[WARNING] Did not save OpenROAD database!
Writing SDF to '/openlane/designs/digital_desing/runs/RUN_2024.07.08_19.16.14/results/signoff/digital_cs.sdf'…
