OpenSTA 2.4.0 41a51eaf4c Copyright (c) 2021, Parallax Software, Inc.
License GPLv3: GNU GPL version 3 <http://gnu.org/licenses/gpl.html>

This is free software, and you are free to change and redistribute it
under certain conditions; type `show_copying' for details. 
This program comes with ABSOLUTELY NO WARRANTY; for details type `show_warranty'.
define_corners Typical
read_liberty -corner Typical /home/celina/.volare/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
Using 1e-12 for capacitance...
Using 1e+03 for resistance...
Using 1e-09 for time...
Using 1e+00 for voltage...
Using 1e-03 for current...
Using 1e-09 for power...
Using 1e-06 for distance...
Reading netlist '/openlane/designs/digital_desing/runs/RUN_2024.07.08_18.49.00/results/synthesis/digital_cs.v'…
Reading design constraints file at '/openlane/scripts/base.sdc'…
[INFO]: Setting output delay to: 2.0
[INFO]: Setting input delay to: 2.0
[INFO]: Setting load to: 0.033442
[INFO]: Setting clock uncertainty to: 0.25
[INFO]: Setting clock transition to: 0.15
[INFO]: Setting timing derate to: 5.0 %
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
======================= Typical Corner ===================================

No paths found.

min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
======================= Typical Corner ===================================

No paths found.

max_report_end
checks_report

===========================================================================
report_checks -unconstrained
===========================================================================
======================= Typical Corner ===================================

No paths found.


===========================================================================
report_checks --slack_max -0.01
============================================================================
======================= Typical Corner ===================================

No paths found.


===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================
======================= Typical Corner ===================================



===========================================================================
report_parasitic_annotation -report_unannotated
============================================================================
Found 18 unannotated drivers.
 clk
 enable
 f_select[0]
 f_select[1]
 f_select[2]
 f_select[3]
 f_select[4]
 f_select[5]
 f_select[6]
 f_select[7]
 _0_/HI
 _0_/LO
 _1_/HI
 _1_/LO
 _2_/HI
 _2_/LO
 _3_/HI
 _3_/LO
Found 0 partially unannotated drivers.

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================

===========================================================================
check_setup -verbose -unconstrained_endpoints -multiple_clock -no_clock -no_input_delay -loops -generated_clocks
===========================================================================
Warning: There are 4 unconstrained endpoints.
  phi_l1
  phi_l2
  phi_p
  phi_r
checks_report_end
power_report

===========================================================================
 report_power
============================================================================
======================= Typical Corner ===================================

Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          0.00e+00   0.00e+00   1.30e-11   1.30e-11 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  0.00e+00   0.00e+00   1.30e-11   1.30e-11 100.0%
                           0.0%       0.0%     100.0%

power_report_end
skew_report

===========================================================================
report_clock_skew
============================================================================
Clock clk
No launch/capture paths found.

skew_report_end
summary_report

===========================================================================
report_tns
============================================================================
tns 0.00

===========================================================================
report_wns
============================================================================
wns 0.00

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack INF
summary_report_end
[WARNING] Did not save OpenROAD database!
Writing SDF to '/openlane/designs/digital_desing/runs/RUN_2024.07.08_18.49.00/results/synthesis/digital_cs.sdf'…
