
===========================================================================
report_tns
============================================================================
tns -2.54

===========================================================================
report_wns
============================================================================
wns -1.15

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.15

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
